Catalogs/ПЛ_УведомленияОСобытиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_УведомленияОСобытиях</Name>
			<Comment>Содержит настройки рассылок и уведомлений заинтересованных лиц о событиях, происходящие в системе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЛ_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычныйТекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелениеПоАдресатам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ДелениеУведомленийПоАдресатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПовторнойОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_СпособыДоставкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресацииУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_СпособыАдресацииУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицыШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_СпособыДоставкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыДоставкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_УведомленияОСобытиях/Forms/РедактированиеВыборкиАдресатов/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерСтроки", НомерСтрокиВладельца);
	
	ИдентификаторВладельца = Параметры.УникальныйИдентификатор;
	
	// Исходная схема компоновки данных копируется в редактируемую схему компоновки данных
	ПЛ_УведомленияОСобытиях.СкопироватьСхемуКомпоновкиДанных(АдресСхемыКомпоновкиВыборкиАдресатов, Параметры.АдресСхемыКомпоновкиДанных);
	
	Если ЗначениеЗаполнено(АдресСхемыКомпоновкиВыборкиАдресатов) Тогда
		ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиВыборкиАдресатов, Параметры.АдресНастроекКомпоновкиДанных);
	КонецЕсли;
	
	Если Параметры.Свойство("ТипИсточника", ТипОбъекта)
		И Параметры.Свойство("ИмяИсточника", Регистратор) Тогда
		
		Если ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			
			СтрокаЗаголовка = НСтр("ru = 'Справочник ""%Регистратор%""'");
			СинонимРегистратора = Метаданные["Справочники"][Регистратор].Синоним;
			СтрокаЗаголовка = СтрЗаменить(СтрокаЗаголовка, "%Регистратор%", СинонимРегистратора);
			Элементы.ОбъектПроверки.Заголовок = СтрокаЗаголовка;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("СправочникСсылка." + Регистратор));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элементы.ОбъектПроверки.ОграничениеТипа = ОписаниеТипов;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			
			СтрокаЗаголовка = НСтр("ru = 'Документ ""%Регистратор%""'");
			СинонимРегистратора = Метаданные["Документы"][Регистратор].Синоним;
			СтрокаЗаголовка = СтрЗаменить(СтрокаЗаголовка, "%Регистратор%", СинонимРегистратора);
			Элементы.ОбъектПроверки.Заголовок = СтрокаЗаголовка;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("ДокументСсылка." + Регистратор));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элементы.ОбъектПроверки.ОграничениеТипа = ОписаниеТипов;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
			
			Элементы.Проверка.Видимость = Ложь;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
			Или ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
			
			Элементы.ГруппаОбъектПроверки.Видимость = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Свойство("Подсказка", Элементы.ДекорацияПодсказка.Заголовок);
	Параметры.Свойство("СпособДоставки", СпособДоставки);
	
	Если СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
		Или СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
		Элементы.СписокАдресатовТекстом.Заголовок = НСтр("ru = 'Адресаты - адреса эл. почты'");
	ИначеЕсли СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС Тогда
		Элементы.СписокАдресатовТекстом.Заголовок = НСтр("ru = 'Адресаты - номера телефонов'");
	ИначеЕсли СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение Тогда
		Элементы.СписокАдресатовТекстом.Заголовок = НСтр("ru = 'Адресаты'");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИзмененаСхемаКомпоновкиДанных(ВыбранноеЗначение, АдресСхемыКомпоновкиВыборкиАдресатов, КомпоновщикНастроек);
		УстановитьВидимость();
	#КонецЕсли
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "Проверка"
		И ТипОбъекта = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.РегламентнаяПроверка") Тогда
		ПолучитьСписокАдресатовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ЗавершитьРедактированиеВыборкиАдресатов();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхему(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиВыборкиАдресатов);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиВыборкиАдресатов)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		Предупреждение(НСтр("ru='Для редактирования схемы компоновки необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайла(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.ПолноеИмяФайла = "";
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
		ВыборФайла.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		
		Если ВыборФайла.Выбрать() Тогда
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ВыборФайла.ПолноеИмяФайла, КодировкаТекста.UTF8);
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			ЗагрузитьСхемуИзФайлаНаСервере(Текст);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	Если ЗначениеЗаполнено(ОбъектПроверки) Тогда
		ПолучитьСписокАдресатовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимость()
	
	ЕстьВидимыеПараметры = Ложь;
	Для каждого Элемент из КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.Элементы Цикл
		Если Элемент.Видимость Тогда
			ЕстьВидимыеПараметры = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Параметры.Видимость = ЕстьВидимыеПараметры;
	
	Если КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Количество() > 2 Тогда
		Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
	Иначе
		Элементы.КомпоновщикНастроекНастройкиОтборДоступныеПоляОтбора.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, УникальныйИдентификатор)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	Возврат ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПолучитьНастройки(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиВыборкиАдресатов, КомпоновщикНастроек);
		УстановитьВидимость();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиВыборкиАдресатов, КомпоновщикНастроек)
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиВыборкиАдресатов);
	
	// Компоновщик настроек инициализируется редактируемой схемой
	ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиВыборкиАдресатов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	ПЛ_УведомленияОСобытиях.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеВыборкиАдресатов()
	
	// Настройки компоновщика настроек помещаются в редактируемую схему
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиВыборкиАдресатов);
	
	Результат = Новый Структура;
	Результат.Вставить("АдресСхемы", АдресСхемыКомпоновкиВыборкиАдресатов);
	Результат.Вставить("АдресНастроек", ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, ИдентификаторВладельца));
	Результат.Вставить("НомерСтроки", НомерСтрокиВладельца);
	Результат.Вставить("АдресатСтрокой", Строка(КомпоновщикНастроек.Настройки.Выбор));
	
	Оповестить("Завершено_редактирование_выборки_адресатов", Результат, ЭтаФорма);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокАдресатовНаСервере()
	
	ВерсияПодсистемыУТ = ПЛ_УведомленияОСОбытиях.ВерсияУТ();
	
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиВыборкиАдресатов);
	АдресНастроек = ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, ИдентификаторВладельца);
	
	СписокАдресатовТекстом.Очистить();
	
	Попытка
		СписокАдресатов = ПЛ_УведомленияОСобытиях.ПолучитьСписокАдресатов(ТипОбъекта, ОбъектПроверки, АдресСхемыКомпоновкиВыборкиАдресатов, АдресНастроек);
	Исключение
		СписокАдресатов = Неопределено;
	КонецПопытки;
	
	Если СписокАдресатов <> Неопределено Тогда
		Для каждого Адресат из СписокАдресатов Цикл
			
			Если СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
				Или СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
			
				Если ТипЗнч(Адресат) = Тип("Строка") Тогда
					Адрес = Адресат;
				Иначе
					Адрес = ПЛ_УведомленияОСобытиях.АдресЭлПочты(Адресат);
				КонецЕсли;
				
				Адрес = ?(Не ЗначениеЗаполнено(Адрес), "<адрес эл. почты не определен>", Адрес);
				СписокАдресатовТекстом.ДобавитьСтроку(Строка(Адресат) + " - " + Адрес);
				
			ИначеЕсли СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС Тогда
				
				Если ТипЗнч(Адресат) = Тип("Строка") Тогда
					Адрес = Адресат;
				Иначе
					Адрес = ПЛ_УведомленияОСобытиях.ПолучитьНомерТелефона(Адресат);
				КонецЕсли;
				
				Адрес = ?(ПустаяСтрока(Адрес), "<номер тел. не определен>", Адрес);
				СписокАдресатовТекстом.ДобавитьСтроку(Строка(Адресат) + " - " + Адрес);
				
			ИначеЕсли СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение Тогда
				
				СписокАдресатовТекстом.ДобавитьСтроку(Строка(Адресат));
				
			КонецЕсли;
		КонецЦикла;
	Иначе
		СписокАдресатовТекстом.ДобавитьСтроку("Не выбрано ни одного адресата.");
	КонецЕсли;
	
КонецПроцедуры
